{
  "backend/main.mo": "Motoko canister managing user profiles, access control, project data, and risk scoring with CRUD functions and analytics tracking.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Prewritten summaries for various frontend components and features.",
  "frontend/index.css": "Tailwind CSS configuration defining light/dark theme variables and base styling.",
  "frontend/index.html": "Base HTML page loading the React app and setting metadata and favicon.",
  "frontend/src/App.tsx": "Main React app handling navigation, theme, onboarding, authentication, and profile setup gating.",
  "frontend/src/components/AppFooter.tsx": "Footer component displaying copyright text and caffeine.ai attribution.",
  "frontend/src/components/AppHeader.tsx": "Header with navigation buttons, chain selector, notifications, and login control.",
  "frontend/src/components/ChainSelector.tsx": "Popover-based blockchain selector with search and analytics tracking.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button integrating Internet Identity auth with query cache handling.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal form for creating a user profile with name and optional bio, saving via a mutation hook.",
  "frontend/src/features/analytics/analyticsEvents.ts": "Defines analytics event types and manages incrementing and storing counts in localStorage.",
  "frontend/src/features/analytics/AnalyticsPanel.tsx": "Displays real-time analytics metrics by polling stored analytics data every second.",
  "frontend/src/features/discover/NewProjectsFeed.tsx": "UI feed showing newly fetched blockchain projects with loading, error, and manual refresh states.",
  "frontend/src/features/discover/projectMappers.ts": "Defines ProjectSummary and maps raw API data into a normalized project summary format.",
  "frontend/src/features/discover/providers/providers.ts": "Provides mock project data generation and simulates API fetching for a chain's projects.",
  "frontend/src/features/discover/useProjectPolling.ts": "Custom hook that polls project data periodically and manages loading, error, and refresh states.",
  "frontend/src/features/glossary/glossaryData.ts": "Static glossary term definitions categorized by topics like blockchain, defi, NFT, and security.",
  "frontend/src/features/glossary/GlossaryDialog.tsx": "Dialog listing glossary terms with search filtering and category badges.",
  "frontend/src/features/learn/learnProgress.ts": "Manages lesson completion state in localStorage and exposes helpers to mark and check progress.",
  "frontend/src/features/learn/lessonCache.ts": "Caches generated lesson data in localStorage, provides retrieval and cache management utilities.",
  "frontend/src/features/learn/lessonGenerator.ts": "Builds lessons from templates with generated dates and retrieves lessons by ID.",
  "frontend/src/features/learn/LessonList.tsx": "Displays lesson cards, tracks completion, and opens lessons while recording analytics events.",
  "frontend/src/features/learn/lessonTemplates.ts": "Defines lesson and quiz templates containing static content and metadata.",
  "frontend/src/features/learn/LessonViewer.tsx": "Displays lesson content in a dialog, supports markdown-style formatting, tracks completion, and launches quizzes when applicable.",
  "frontend/src/features/learn/QuizRunner.tsx": "Renders a single-question quiz with answer selection, feedback, analytics logging, and a completion callback.",
  "frontend/src/features/notifications/NotificationCenter.tsx": "Displays notifications in a dialog with read, mark-all, and clear actions.",
  "frontend/src/features/notifications/notificationsStore.ts": "Handles storing, updating, and managing notifications and preferences in localStorage.",
  "frontend/src/features/notifications/notificationTypes.ts": "Defines notification types, structures, and user preference interfaces.",
  "frontend/src/features/offline/offlineStatus.ts": "Provides online/offline status tracking via browser events.",
  "frontend/src/features/onboarding/OnboardingFlow.tsx": "Implements a multi-step onboarding modal with progress tracking, skip/complete actions, and step-specific content.",
  "frontend/src/features/onboarding/onboardingStore.ts": "Provides state and helpers for tracking onboarding completion using localStorage.",
  "frontend/src/features/projects/ProjectCard.tsx": "Displays a project summary card with risk level, metadata, social badges, and opens a detailed dialog.",
  "frontend/src/features/projects/ProjectDetailsDialog.tsx": "Shows a detailed modal with full project info including token details, socials, and risk analysis.",
  "frontend/src/features/risk/RiskBadge.tsx": "Renders a visual badge for a project's risk level with icons and color coding.",
  "frontend/src/features/risk/RiskDetails.tsx": "Displays detailed risk assessment info including explanation, signals, and an expandable analysis section.",
  "frontend/src/features/risk/riskHeuristics.ts": "Defines risk level types and calculates a project's risk based on audits, team transparency, liquidity, volume, and age.",
  "frontend/src/features/settings/NotificationPreferences.tsx": "Provides switches for enabling or disabling notification preferences for new projects and lessons.",
  "frontend/src/features/settings/ProviderStatusPanel.tsx": "Lists data providers with their availability and backend requirements, displaying status indicators.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading identities, handling login/logout, and exposing login state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and updating projects, analytics, and user profile data via the actor.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/lib/formatting.ts": "Utility functions for relative time formatting, timestamp display, and safe URL validation.",
  "frontend/src/lib/utils.ts": "Provides a Tailwind-compatible class merging helper using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the dashboard hero, feature cards, and stats based on the selected blockchain.",
  "frontend/src/pages/DiscoverPage.tsx": "Displays the discovery feed for new blockchain projects.",
  "frontend/src/pages/LearnPage.tsx": "Shows a list of educational lessons covering Web3 topics.",
  "frontend/src/pages/SettingsPage.tsx": "Provides settings for user profile, onboarding reset, offline status info, cache management, and analytics panels.",
  "frontend/src/state/chain.tsx": "Defines supported blockchains and provides a React context for selecting and persisting the active chain in localStorage.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, storing them in sessionStorage, and managing persisted values across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, animations, and plugins for the frontend UI.",
  "project_state.json": "Project metadata describing the CryptoLaunch Sentinel app, its features, architecture notes, and versioned project state."
}