{
  "backend/main.mo": "Main backend actor handling access control, user profiles, project storage, analytics, and risk scoring with admin-gated data provider config.",
  "backend/migration.mo": "Migration module converting old user profiles by removing email fields and producing the new userProfiles map.",
  "feature_evidence.json": "Feature evidence report linking features to source files, components, tests, and metadata for release readiness.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend files and their responsibilities across pages, components, and features.",
  "frontend/index.css": "Tailwind CSS base configuration defining light/dark theme variables and global styles.",
  "frontend/index.html": "HTML entry point setting app metadata, favicon, description, and loading the main React bundle.",
  "frontend/src/App.tsx": "Root React component handling routing, theme, user profile setup, onboarding, and global providers.",
  "frontend/src/components/AppFooter.tsx": "Footer component displaying attribution and styling.",
  "frontend/src/components/AppHeader.tsx": "Header component with navigation, chain selector, notifications, and login integration.",
  "frontend/src/components/ChainSelector.tsx": "Dropdown component for selecting a blockchain and recording analytics on selection.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and error handling.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog for creating a user profile with name and optional bio.",
  "frontend/src/features/analytics/analyticsEvents.ts": "Defines analytics event types and stores/retrieves event counters in localStorage.",
  "frontend/src/features/analytics/AnalyticsPanel.tsx": "Displays locally stored analytics metrics in a table with periodic refresh.",
  "frontend/src/features/discover/NewProjectsFeed.tsx": "UI feed showing new blockchain projects with loading, error, and refresh states.",
  "frontend/src/features/discover/projectMappers.ts": "Maps raw project data to a standardized ProjectSummary format with defaults.",
  "frontend/src/features/discover/providers/providers.ts": "Maps backend Project objects into UI-friendly ProjectSummary objects.",
  "frontend/src/features/discover/useProjectPolling.ts": "Fetches and maps projects for a chain with polling, loading, and refresh info.",
  "frontend/src/features/glossary/glossaryData.ts": "Static list of glossary terms with definitions and categories.",
  "frontend/src/features/glossary/GlossaryDialog.tsx": "Glossary search dialog displaying categorized Web3 terms and definitions.",
  "frontend/src/features/learn/learnProgress.ts": "Tracks lesson completion in localStorage and exposes hooks to mark and check progress.",
  "frontend/src/features/learn/lessonCache.ts": "Caches generated lesson data in localStorage and provides helpers to read, write, and clear cache metadata.",
  "frontend/src/features/learn/lessonGenerator.ts": "Generates lesson objects from templates with dated ordering and provides lookup by lesson ID.",
  "frontend/src/features/learn/LessonList.tsx": "Renders a grid of generated lessons with category badges, completion status, and opens a viewer modal when selected.",
  "frontend/src/features/learn/lessonTemplates.ts": "Defines lesson templates including content, categories, quizzes, and optional videos for lesson generation.",
  "frontend/src/features/learn/LessonViewer.tsx": "Displays full lesson content in a dialog, handles completion, caching, and triggers an optional quiz.",
  "frontend/src/features/learn/QuizRunner.tsx": "Runs a multiple‑choice quiz, handles submission, feedback, analytics, and triggers completion callbacks.",
  "frontend/src/features/notifications/NotificationCenter.tsx": "Shows a notifications dialog with scrolling list, read state management, and bulk actions.",
  "frontend/src/features/notifications/notificationsStore.ts": "Manages notification state and preferences using localStorage, providing actions to add, read, clear, and update settings.",
  "frontend/src/features/notifications/notificationTypes.ts": "Defines notification types, the Notification interface, and user preference structure.",
  "frontend/src/features/offline/offlineStatus.ts": "Provides a hook that tracks online/offline status using browser events.",
  "frontend/src/features/onboarding/OnboardingFlow.tsx": "Implements a multi-step onboarding dialog with progress, navigation, and completion logic.",
  "frontend/src/features/onboarding/onboardingStore.ts": "Manages onboarding state using localStorage and exposes helpers for triggering or completing onboarding.",
  "frontend/src/features/projects/ProjectCard.tsx": "Renders a project summary card with risk level, social tags, and a button to open detailed project info.",
  "frontend/src/features/projects/ProjectDetailsDialog.tsx": "Displays an expanded dialog with full project details including token data, socials, and risk assessment.",
  "frontend/src/features/risk/RiskBadge.tsx": "Shows a styled badge representing a project's risk level with corresponding icon and colors.",
  "frontend/src/features/risk/RiskDetails.tsx": "Presents a detailed risk assessment with explanations, signals, and an expandable analysis section.",
  "frontend/src/features/risk/riskHeuristics.ts": "Calculates a project's risk level based on audits, transparency, liquidity, volume, and age.",
  "frontend/src/features/settings/NotificationPreferences.tsx": "Provides UI switches for enabling or disabling notification preferences for new projects and lessons.",
  "frontend/src/features/settings/ProviderStatusPanel.tsx": "Displays status of configured blockchain data providers with loading and error states.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and identity state management.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating projects, analytics, user profiles, and data provider status via the actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/lib/formatting.ts": "Utility functions for formatting timestamps, relative times, and safely validating URLs.",
  "frontend/src/lib/utils.ts": "Provides a class name merging helper combining clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page with hero section, feature cards, and contextual chain-based messaging.",
  "frontend/src/pages/DiscoverPage.tsx": "Page displaying a real-time feed of new blockchain projects.",
  "frontend/src/pages/LearnPage.tsx": "Page showing a list of Web3 learning lessons.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page with user profile editing, cache clearing, sync info, and various settings panels; loads/saves profile via hooks and handles offline status.",
  "frontend/src/state/chain.tsx": "React context storing the selected blockchain with persistence to localStorage and utilities for accessing supported chains.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, storing/retrieving them in sessionStorage, and managing persisted query values including hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, typography, animations, and plugins for the frontend UI.",
  "project_state.json": "Project metadata describing the CryptoLaunch Sentinel app, architecture notes, existing features, and requirements tracking."
}