{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-09T03:21:42.357Z",
  "summary": "Diff implements email removal (with migration), updates Discover feed to use backend-fetched projects (no mock generator), adds runtime provider status UI hooks, and sets production-facing index.html metadata. However, backend support for provider secret configuration/status and backend project-fetch endpoints are not clearly evidenced in the truncated backend diff.",
  "missing_requirements": [
    {
      "id": "REQ-14",
      "requirement": "Implement publish-time configuration for external data provider secrets in the backend (admin-only set/update for Alchemy, Moralis, QuickNode, Bitquery, CoinMarketCap), store secrets in canister state, never return them to frontend, and execute secret-required HTTP calls only from backend.",
      "reason": "Diff shows a DataProviderConfig type and an in-memory map, but does not show any admin-only methods to set/update secrets, any stable storage for secrets, nor any backend HTTP-outcall implementations that use those secrets and return sanitized results. With backend/main.mo truncated, these required endpoints/behaviors are not verifiable from provided evidence.",
      "evidence": [
        "backend/main.mo"
      ]
    },
    {
      "id": "REQ-15",
      "requirement": "Make Settings > Data Providers panel reflect real runtime/provider readiness fetched from backend, differentiating active, needs configuration (missing keys), and unavailable/error.",
      "reason": "Frontend now queries getAvailableDataProviders(), but the panel (in shown portion) appears to treat returned providers as 'Active' and does not provide verifiable evidence of the full 3-state differentiation driven by backend runtime checks; backend methods (getAvailableDataProviders/checkDataProviderStatus) are not evidenced in backend/main.mo excerpt.",
      "evidence": [
        "frontend/src/features/settings/ProviderStatusPanel.tsx",
        "frontend/src/hooks/useQueries.ts",
        "backend/main.mo"
      ]
    },
    {
      "id": "REQ-13",
      "requirement": "Replace mock Discover feed generation with a backend-mediated projects fetch suitable for publishing.",
      "reason": "Frontend now calls actor.getProjects() (filtered by chain) and no longer uses the mock generator, but the diff does not show the backend actor implementing a getProjects() (or equivalent) query that returns discovery projects suitable for publishing. Because backend/main.mo is truncated, this backend-side requirement cannot be confirmed.",
      "evidence": [
        "frontend/src/hooks/useQueries.ts",
        "backend/main.mo"
      ]
    }
  ],
  "hallucinated_features": [],
  "confidence": 0.55,
  "changed_files": [
    "backend/main.mo",
    "backend/migration.mo",
    "frontend-file-summaries.txt",
    "frontend/index.html",
    "frontend/src/features/discover/NewProjectsFeed.tsx",
    "frontend/src/features/discover/providers/providers.ts",
    "frontend/src/features/discover/useProjectPolling.ts",
    "frontend/src/features/settings/ProviderStatusPanel.tsx",
    "frontend/src/hooks/useQueries.ts",
    "frontend/src/pages/SettingsPage.tsx",
    "project_state.json"
  ]
}